using UnityEngine;

// 던전 설정들..

// 일반던전 : 도시 소속
// 특수던전 : 지도상 독립 위치


// 던전 성향

// [적군 설정]
// 월드 메이킹 시점에서 확정
// 던전 적군 파티 조우 확률 및 개체수
// 1안 : 고정값 , 일반:80 , 정예: 15 , 희소 : 5 (확률 csv)
// 희소등급별 적군 개체수 확률
// 일반 : 2~6 개체의 단순 확률 , 정예 : 1~2 개체 , 희소 : 1~2개체 
// 대열 : 일반 등급만 해당. 무작위로 전후방 개체 나누기 , 전열이 없으면 최소 전열 1체 이상

// 적군의 종류 갯수
// 현재는 던전의 규모(0~n) 에 따라 적군 종류가 달라지도록 한다.( 등급 , 난이도하고는 별개 , 순수 사이즈만 관련 )
// 전역 csv 에서 참조

// [아이템 설정]
// 보이는 보물상자 , 숨겨진 아이템 
// 월드 메이킹 시점에서 태그 또는 확률만 정의? , 던전 월드 업데이트시에 정하기
// 획득 지점은 던전의 방에서만 가능 , 통로에는 배치 안함
// 일정 확률로 방마다 보물 상자를 배치 (각 방마다 독립확률이니 전체 방에 다 있을수도 , 한개도 없을수도 있다.) 
// 보물 박스 아이템 비율 : 소비 70 , 돈 20 , 장비 10 (확률 csv)
// 숨김 아이템 : 일단 무조건 수집 , 그 외 퀘스트에서 유니크 아이템?

// [던전 형태 , 규모]
// 일반 , 특수 구분
// 일단 도시 던전은 모두 일반으로 분류
// 특수 던전은 독립 좌표로 지정된 던전 , 현재는 클로드 지도 메이킹에서 만든 던전은 모두 해당
// 일반
// 일반 던전 계층 개수는 도시 규모에 비례 , 심연은 대도시 이상만?
// 특수
// 다양한 형식이 있다
// -일반 + 입장 조건 : 직업 , 인원수 등등 제한
// -일반 + 심연      : 심연 존재
// -무작위           : 입장 할때 마다 새로 생성
// -무한 계층        : 도전용 
// 일단 나열된 형식들은 확률로 생성 , 또는 무한 계층은 소수이거나 후반에만...?

public class Make_Dungeon : MakeBase
{
    
}
