using UnityEngine;

/// <summary>
/// 유니크 캐릭터
/// 인게임에서 만들수도 있다.
/// 아이템과 마찬가지로 동급 최대 점수로 만든다.
/// 
/// 여기서는 메이킹 인물들 만들기.
/// - 중대 도시급의 인물 : 도시 유니크 임무 , 또는 도시 호감도 완료 , 수도 -> 6클래스 , 대도시 -> 5클래스
/// -- csv : [수도 , 대도시 의 클래스 등급 ]
/// 
/// - 재야 숨은 인재 :  특정 도시에 관계 없이 정보 수집 , 대략 4~8 클래스 , 당연히 고 클래스일수록 정보 개수 많아짐, 최종적으로 아무 도시에 배치한다.
///                    정보가 다 모아지면 알림으로 특정 도시 알림 , 도시 진입하면 바로 영입
/// -- csv : [인원수 , 클래스 등급 , 소문 개수]
/// 																			
/// 
/// </summary>

public class Make_CharUnique : MakeBase
{
    
}
